#pragma once
#include <Windows.h>
#include <TlHelp32.h>
#include <vector>
#include <list>
#include <string>
#include <tchar.h>
#include "umvc3_sMvc3Main.h"
#include "..\utils\Trampoline.h"
//#include "../glm/vec2.hpp"
//#include "../glm/vec3.hpp"

inline bool BeginHitboxDisplay = false;

inline HANDLE HProc = 0;
inline bool ValidVer;
inline int GameMode;
inline uint64_t moduleBase;
inline uint64_t sBattleSetting;
inline uint64_t gSound;
inline uint64_t sAction;
inline uint64_t sCharacter;
inline uint64_t Player1CharNodeTree;
inline uint64_t Player2CharNodeTree;
inline uint64_t BaseFighterUpdateMethod = 0x14004bd30;
inline uint64_t sGameConfig;
inline uint64_t uActionSideCamera;
inline int MatchFlag;
inline bool ToolActive = true;
inline float NearPlane;
inline float FarPlane;
inline float mFOV;

struct __declspec(align(8))Vector3
{
	float x;
	float y;
	float z;
};

inline Vector3 CameraPos;
inline Vector3 CameraUp;
inline Vector3 TargetPos;

inline static int RESOLUTION_X = 1800;
inline static int RESOLUTION_Y = 900;

inline DWORD errorMessageID;
inline int P1Character1ID;
inline int P1Character2ID;
inline int P1Character3ID;
inline int P2Character1ID;
inline int P2Character2ID;
inline int P2Character3ID;
inline uint64_t P1Character1Data;
inline uint64_t P1Character2Data;
inline uint64_t P1Character3Data;
inline uint64_t P2Character1Data;
inline uint64_t P2Character2Data;
inline uint64_t P2Character3Data;
inline uint64_t team1ptr;
inline uint64_t team2ptr;
inline int TempA;

inline float P1C2GroundRemaingHitstunPREV = 0.0;
inline float P1C2AirRemaingHitstunPREV = 0.0;
inline float P1C3GroundRemaingHitstunPREV = 0.0;
inline float P1C3AirRemaingHitstunPREV = 0.0;
inline float P2C1GroundRemaingHitstunPREV = 0.0;
inline float P2C1AirRemaingHitstunPREV = 0.0;
inline float P2C2GroundRemaingHitstunPREV = 0.0;
inline float P2C2AirRemaingHitstunPREV = 0.0;
inline float P2C3GroundRemaingHitstunPREV = 0.0;
inline float P2C3AirRemaingHitstunPREV = 0.0;

inline char P1C1AirGroundState;
inline char P1C2AirGroundState;
inline char P1C3AirGroundState;
inline char P2C1AirGroundState;
inline char P2C2AirGroundState;
inline char P2C3AirGroundState;

inline float P1C1RemaingBlockstunMAX = 0.0;
inline float P1C2RemaingBlockstunMAX = 0.0;
inline float P1C3RemaingBlockstunMAX = 0.0;
inline float P2C1RemaingBlockstunMAX = 0.0;
inline float P2C2RemaingBlockstunMAX = 0.0;
inline float P2C3RemaingBlockstunMAX = 0.0;

inline float P1C1RemaingBlockstunPREV = 0.0;
inline float P1C2RemaingBlockstunPREV = 0.0;
inline float P1C3RemaingBlockstunPREV = 0.0;
inline float P2C1RemaingBlockstunPREV = 0.0;
inline float P2C2RemaingBlockstunPREV = 0.0;
inline float P2C3RemaingBlockstunPREV = 0.0;

inline float P1C1PushblockTimer = 0.0;
inline float P1C2PushblockTimer = 0.0;
inline float P1C3PushblockTimer = 0.0;
inline float P2C1PushblockTimer = 0.0;
inline float P2C2PushblockTimer = 0.0;
inline float P2C3PushblockTimer = 0.0;

inline float P1C1PushblockTimerMAX = 0.0;
inline float P1C2PushblockTimerMAX = 0.0;
inline float P1C3PushblockTimerMAX = 0.0;
inline float P2C1PushblockTimerMAX = 0.0;
inline float P2C2PushblockTimerMAX = 0.0;
inline float P2C3PushblockTimerMAX = 0.0;

inline float P1C1PushblockTimerPREV = 0.0;
inline float P1C2PushblockTimerPREV = 0.0;
inline float P1C3PushblockTimerPREV = 0.0;
inline float P2C1PushblockTimerPREV = 0.0;
inline float P2C2PushblockTimerPREV = 0.0;
inline float P2C3PushblockTimerPREV = 0.0;

inline int P1C1CharState;
inline int P1C2CharState;
inline int P1C3CharState;
inline int P2C1CharState;
inline int P2C2CharState;
inline int P2C3CharState;

inline byte P1C1VulnState;
inline byte P1C2VulnState;
inline byte P1C3VulnState;
inline byte P2C1VulnState;
inline byte P2C2VulnState;
inline byte P2C3VulnState;

inline byte P1C1TagState;
inline byte P1C2TagState;
inline byte P1C3TagState;
inline byte P2C1TagState;
inline byte P2C2TagState;
inline byte P2C3TagState;

inline int P1C1CurAnmchrID;
inline int P1C2CurAnmchrID;
inline int P1C3CurAnmchrID;
inline int P2C1CurAnmchrID;
inline int P2C2CurAnmchrID;
inline int P2C3CurAnmchrID;

inline byte P1Child1TempVulnState;
inline int P1Child1TempCharState;
inline int P1Child1CurAnmchrID;

inline bool Emptytied = false;

inline std::vector<int> ChildCharacterCurAnmchrID;

inline uint32_t DebugPointerOfSorts;

inline std::string ThreeHookPath = "E:\\ULTIMATE MARVEL VS. CAPCOM 3\\Scripts\\ThreeHook.asi";

//inline uint64_t moduleBaseInternal = (uint64_t)GetModuleHandle(_T("umvc3.exe"));

inline sMvc3Manager* ThreeManager;

struct vector {
	float X;
	float Y;
	float Z;
};

struct vector4 {
	float X;
	float Y;
	float Z;
	float W;
};

struct cHitPrimSphere {
	long PointerIdentifier;
	int mType;
	int Unknown0C;
	int mMargin;
	int Unknown14;
	int Unknown18;
	int Unknown1C;
	vector Coordinates;
	float Radius;
	int Flag;
	int Unknown34;
	long ParentPointer;
	int Unknown3C;
	int BoneIndex;
	float SizeRateX;
	float SizeRateY;
	float SizeRateZ;
	int mOfs50;
	int mOfs54;
	int mOfs58;
	int mOfs5C;
	int mOfs60;
	int mOfs64;
	int mOfs68;
	int mOfs6C;
};

//Spheres.
struct Hurtbox
{
	long PointerIdentifier;
	int mType;
	int Unknown0C;
	long PointerToMoreData;
	cHitPrimSphere CollData;
	int Unknown18;
	int Unknown1C;
	float GlobalX;
	float GlobalY;
	float GlobalZ;
	int Unknown2C;
	float SecondaryX;
	float SecondaryY;
	float SecondaryZ;
	int Unknown3C;
	float DeFactoX;
	float DeFactoY;
	float DeFactoZ;
};

//Capsules.
struct Hitbox
{
	long ContainerIdentifier;
	int mType;
	long PointerToCapsuleData;
	long CapsuleIdentifier;
	cHitPrimSphere CollData;
	Vector3 ContainerPos;
	Vector3 CapsulePrimaryPos;
	Vector3 CapsuleSecondPos;
	float Radius;
	int mMargin;

};

struct cHitPrimCapsule {
	long PointerIdentifier;
	int mType;
	int Unknown0C;
	int mMargin;
	int Unknown14;
	int Unknown18;
	int Unknown1C;

	vector4 Point1;

	vector4 Point2;

	float Radius;
	int Unknown44;
	int Unknown48;
	int Unknown4C;

	int Flag;
	int Uknown54;
	long mpParent0;

	long mpParent1;
	int mParentNo0;
	int mParentNo1;

	float SizeRateX;
	float SizeRateY;
	float SizeRateZ;
	int Unknown7C;

	float Unknown80;
	float Unknown84;
	float Unknown88;
	float Unknown8C;

	float Unknown90;
	float Unknown94;
	float Unknown98;
	float Unknown9C;

	int mOfsA0;
	int mOfsA4;
	int mOfsA8;
	int mOfsAC;


};

struct MarvelVector {
	float x;
	float y;
	float xVelocity;
};

enum EGroundedState :uint8_t {
	NoGround = 0,
	Grounded = 0xF4,
	InAir = 0xF2,
};

enum ETagState :uint8_t {
	NoTag = 0,
	Active = 0x0D,
	Inactive = 0x09,
	Active2 = 0x68,
	TagginOut = 0xB4,
	TagginIn = 0x6c
};

struct mShotGroupAnmSerial {
	uint8_t ParamA;
	uint8_t ParamB;
	uint8_t ParamC;
	uint8_t ParamD;
};

struct mbShotGroupHit {
	bool Hit;
};

struct FighterInstall
{
	int IdentifyingHashA;
	int IdentifyingHashB;
	int InstallID;
	int mType;
	float Duration;
	int PossibleRelatedAnmchrEntry;
	int mAblF;
	int mAb2F;
	float mLifeAdd;
	float RedHealthRegen;//Either Converts Yellow Health to Red Health or heals current Red Health.
	float MeterRegen;//Meter Regen.
	float YellowHealthRegen;//Gained Yellow Health becomes Red Health. Can lose total HP with this and be set to 1HP.
	float mRLifeAdd;
	float MeterGain;
	float mRLifeAddRate;
	float DamageMultiplier;
	float DefenseMultiplier;//Incoming Damage Multiplier.
	float SpeedMultiplier;
	float mSpArmorDmgRate;
	int mSpArmorShield;
	int UnknowmSpArmorShieldAddChr;
	int mUserI;
	int Unknown58;
	int Unknown5C;
	int Unknown60;
	int mUserF;
	int Unknown68;
	int Unknown6C;
	int Unknown70;
	int Unknown74;
	int Unknown78;
	int Unknown7C;

};

struct Fighter { // TODO map this out
	char offset[0x14];//0x14
	ETagState tagState;//0x15
	char offset2[0x3B];//0x50
	MarvelVector vector;//0x5C
	char offset3[0x10];//0x6C
	EGroundedState  groundedState;//0x6D
	char offset4[0x12A3];//0x1310
	int AnimIDA;//0x1314
	int AnimIDOld;//0x1318
	char offset5[0x10];//0x1328
	float CurrentFrameA;//0x132C
	float CurrentFrameB;//0x1330
	//....
	FighterInstall Installs[5] = { 0 };//0x1570
	//.....
	char offset6[0x50D0];//0x6400
	float ArmorTimer;//0x6404
	float ArmorDamageMultiplier;//0x6408
	int ArmorShield;//I think this means the hit threshold??//0x640C
	char offset7[0x24];//0x6430
	int CurrentShotGroup;//0x6434
	mShotGroupAnmSerial ShotGroupSerials[8];//0x6454
	mbShotGroupHit ShotGroupHits[8];//0x645C
	//Commented Out because I don't quite understand it and need to set it aside for further testing and mapping out.
	//char offset4[0xc7];//0x134
	//uint16_t specialState;//specialstate? 0x136??
	//char offset5[0x528];
	//uint32_t anim; // anim??
};

struct ScriptableFighter {
	Fighter* fighter = 0;
	intptr_t fighterController = 0; // TODO find better name for this
	char* name = nullptr;

	uint64_t tickPtr = 0x14004bd30;
	void Tick() {
		//((void(__fastcall*)(longlong*))_addr(tickPtr))((longlong*)fighter);
		if (HProc) {
			ReadProcessMemory(HProc, (LPVOID*)(0x14004bd30), &fighter, sizeof(longlong), 0);
		}
	};

	const char* GetGroundedState() {
		switch (fighter->groundedState)
		{
		case Grounded:
			return "Grounded";
		case InAir:
			return "InAir";
		default:
			return "Unkown";
			break;
		}
	}
	const char* GetTagState() {
		switch (fighter->tagState)
		{
		case Active:
		case Active2:
			return "Active";
		case Inactive:
